tbobd/certification2/test5/HotelRoomAvailabilityRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
    </hot:Credentials>
    <wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action>
    <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelRoomAvailabilityRequest>
        <hot:SessionId>ec068e95-e2bf-4f87-bca2-a1e7a97f750e</hot:SessionId>
        <hot:ResultIndex>3</hot:ResultIndex>
        <hot:HotelCode>1632763</hot:HotelCode>
        <hot:ResponseTime>23</hot:ResponseTime>
        <hot:IsCancellationPolicyRequired>true</hot:IsCancellationPolicyRequired>
    </hot:HotelRoomAvailabilityRequest>
</soap:Body>
</soap:Envelope>